Documents/ПеремещениеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПеремещениеСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.БДР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоПрогноз</Name>
					<Comment>означает, что этот документ - планируемый, т.е.вместо него будет введе другой документ, не обязательно с такими же параметрами</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КошелекПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьКомиссию</Name>
					<Comment>для снятия нала с кредитки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДРКомиссия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>сумма в валюте кошелька</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрогноз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрогнозРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>флВнутреннее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПеремещениеСредств/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
    Попытка 
		ДатаЗапрета = Константы.ДатаЗапретаРедактирования.Получить();
		Если ЗначениеЗаполнено(ДатаЗапрета) Тогда
			Если Дата <= ДатаЗапрета Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// регистр ДенежныеСредства Расход
		ОбщийМодуль1Сервер.ДвижениеДенежныхСредств(
					Движения.ДенежныеСредства, 
					ВидДвиженияНакопления.Расход, 
					Дата, 
					Кошелек, 
					Сумма, Валюта, Курс, Кратность, ЭтоПрогноз);
		
		// регистр ДенежныеСредства Приход
		ОбщийМодуль1Сервер.ДвижениеДенежныхСредств(
					Движения.ДенежныеСредства, 
					ВидДвиженияНакопления.Приход, 
					Дата, 
					КошелекПриемник, 
					Сумма, Валюта, Курс, Кратность, ЭтоПрогноз);
					
		// регистр БДР 
		Если ЗначениеЗаполнено(СтатьяДР) Тогда
			//ОбщийМодуль1Сервер.ДвижениеБДРФакт(Движения.БДР, СтатьяДР, Сумма, Дата);
			ОбщийМодуль1Сервер.ДвижениеБДРФакт(Движения.БДР, СтатьяДР, 
				ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(Сумма, Валюта, Курс, Кратность), Дата
			,,,,ЭтоПрогноз);
			
		КонецЕсли;

		
		//нюансы
		
		//регистр Кредиты - расход по кредитной карте означете взятие кредита типа Овердрафт
		Если Кошелек.КредитнаяКарта Тогда
			
			//если статья кредита заполнена, то надо отразить взятие кредита в доходах
			Если НЕ ЗначениеЗаполнено(Кошелек.СтатьяКредитПолученный) Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"Обязательно укажите статью для полученных кредитов в кошельке!");
				Возврат;
			КонецЕсли;
			
			//отразить в бюджете факт взятия кредита
			ОбщийМодуль1Сервер.ДвижениеБДРФакт(Движения.БДР, Кошелек.СтатьяКредитПолученный, 
				ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(Сумма, Валюта, Курс, Кратность), Дата,,,,ЭтоПрогноз);
			
			//Если в документе выбрали ту же статью, по которой берется кредит - это ошибка
			Если Кошелек.СтатьяКредитПолученный = СтатьяДР Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"Выбрана статья, по которой берется овердрафт, это ошибка! Должна быть расходная статья!");
				Возврат;
			КонецЕсли;
			
			//регистр Кредиты
			ОбщийМодуль1Сервер.ДвиженияКредитов(ЭтотОбъект, Дата, Кошелек, 
				Сумма, ВидДвиженияНакопления.Приход, Валюта, Курс, Кратность);		
		КонецЕсли;
		
					
		//регистр Кредиты - перечисление на кредитную карту означает возврат кредита
		Если КошелекПриемник.КредитнаяКарта Тогда	
			ОбщийМодуль1Сервер.ДвиженияКредитов(ЭтотОбъект, Дата, КошелекПриемник,
				Сумма, ВидДвиженияНакопления.Расход, Валюта, Курс, Кратность);
		КонецЕсли;
		
		
		//учтем комиссию
		Если УчитыватьКомиссию Тогда
			
			Если Кошелек.КредитнаяКарта Тогда
				////комиссию тоже надо включить в кредит
				//ОбщийМодуль1Сервер.ДвиженияКредитов(ЭтотОбъект, Дата, Кошелек, 
				//	СуммаКомиссии, ВидДвиженияНакопления.Приход, Валюта, Курс, Кратность);
				//	
					
				//если статья кредита заполнена, то надо отразить взятие кредита в доходах
				Если  ЗначениеЗаполнено(Кошелек.СтатьяКредитПолученный) Тогда
					
					//отразить в бюджете факт взятия кредита - сумма комиссии
					ОбщийМодуль1Сервер.ДвижениеБДРФакт(Движения.БДР, Кошелек.СтатьяКредитПолученный, 
						ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(СуммаКомиссии, Валюта, Курс, Кратность), Дата,,,,ЭтоПрогноз);
						
				КонецЕсли;
			
			КонецЕсли;
			
			// регистр ДенежныеСредства Расход - списали комиссию
			ОбщийМодуль1Сервер.ДвижениеДенежныхСредств(
						Движения.ДенежныеСредства, 
						ВидДвиженияНакопления.Расход, 
						Дата, 
						Кошелек, 
						СуммаКомиссии, Валюта, Курс, Кратность, ЭтоПрогноз);
			
			//провели списание комисси по БДР, если требуется
			Если ЗначениеЗаполнено(СтатьяДРКомиссия) Тогда //это в расходную часть бюджета
				ОбщийМодуль1Сервер.ДвижениеБДРФакт(Движения.БДР, СтатьяДРКомиссия, 
					ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(СуммаКомиссии, Валюта, Курс, Кратность), Дата,,,,ЭтоПрогноз);
			КонецЕсли;
			
		КонецЕсли;
		
		
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка проведения", УровеньЖурналаРегистрации.Ошибка, , ссылка, ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	//НеРегистрироватьВПланеОбмена = Неопределено;
	//ДополнительныеСвойства.Свойство("НеРегистрироватьВПланеОбмена", НеРегистрироватьВПланеОбмена);
	//Если НеРегистрироватьВПланеОбмена <> Истина Тогда //только сравнение с истиной!
	//	Узел = ПланыОбмена.ОбменСAndroid.НайтиПоКоду("02");
	//	Если Узел <> ПланыОбмена.ОбменСAndroid.ПустаяСсылка() Тогда
	//		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Ссылка);
	//	КонецЕсли;
	//КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Для Каждого Движение Из Движения Цикл
		Движение.Очистить();
		Движение.Записать();
	КонецЦикла;
КонецПроцедуры
